blogger/app/controllers/posts_controller.rb

    def index
        @posts = Post.all.order(:created_at)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" ASC

    def update

        return unless @post.persisted?

        if @post.update(create_update_post_params)
---
UPDATE "posts" SET "updated_at" = $1, "body" = $2 WHERE "posts"."id" = $3  [["updated_at", "2022-12-09 23:48:48.781131"], ["body", "This is more like what it should be lol."], ["id", 37]]

    def create

        @post = Post.new(create_update_post_params)

        if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "title", "body") VALUES ($1, $2, $3, $4) RETURNING "id"

    def destroy
        if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 37]]

    def set_post
        @post = params[:id].present? ? Post.find(params[:id]) : Post.new
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]